1c-configuration-manager/src/InformationRegisters/СравнениеКонфигураций/СравнениеКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СравнениеКонфигураций</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипИзменений</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПредыдущейФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтОкончанияФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВероятностьУспеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПеред</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПосле</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МодульБазовойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>МодульИзмененнойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.ТипыПроблем</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработки</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/Enums/СтатусыОбработки/СтатусыОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработки</name>
  <enumValues>
    <name>ТребуетсяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Частично</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/Enums/ТипыПроблем/ТипыПроблем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПроблем</name>
  <enumValues>
    <name>Порядок</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Неопределено</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/Enums/ТипыИзменений/ТипыИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзменений</name>
  <enumValues>
    <name>Совпадение</name>
  </enumValues>
  <enumValues>
    <name>Вставка</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>Замена</name>
  </enumValues>
  <enumValues>
    <name>Неизвестно</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/InformationRegisters/СравнениеКонфигураций/ManagerModule.bsl
Функция ПолучитьОтличияФайловСравнение(Сценарий,Ключ) Экспорт
	
	ДанныеОтличий= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Срав.Текст КАК Текст,
	|	Срав.ИмяФункции КАК ИмяФункции,
	|	Срав.ТипИзменений КАК ТипИзменений,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА """"
	|		ИНАЧЕ Срав.Проблема
	|	КОНЕЦ КАК Проблема,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Порядок)
	|		ИНАЧЕ Срав.ТипПроблемы
	|	КОНЕЦ КАК ТипПроблемы,
	|	Срав.Длина КАК Длина,
	|	Срав.UID КАК UID
	|ИЗ
	|	РегистрСведений.СравнениеКонфигураций КАК Срав
	|ГДЕ
	|	Срав.Сценарий = &Сценарий
	|	И Срав.Ключ = &Ключ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Срав.ОтНачалаФайла,
	|	ВЫБОР
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление)
	|			ТОГДА 1
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка)
	|			ТОГДА 2
	|		ИНАЧЕ 10
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = Новый Структура("Текст,ТипИзменений,ИмяФункции,ТипПроблемы,Проблема,Длина,UID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Выборка);
		ДанныеОтличий.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат ДанныеОтличий;
	
КонецФункции




Функция ПолучитьИсходныйБазовыйФайл(Сценарий,Ключ) Экспорт
	
	ДанныеОтличий= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Срав.Текст КАК Текст,
	|	Срав.ИмяФункции КАК ИмяФункции,
	|	Срав.ТипИзменений КАК ТипИзменений,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА """"
	|		ИНАЧЕ Срав.Проблема
	|	КОНЕЦ КАК Проблема,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Порядок)
	|		ИНАЧЕ Срав.ТипПроблемы
	|	КОНЕЦ КАК ТипПроблемы,
	|	Срав.Длина КАК Длина,
	|	Срав.UID КАК UID
	|ИЗ
	|	РегистрСведений.СравнениеКонфигураций КАК Срав
	|ГДЕ
	|	Срав.Сценарий = &Сценарий
	|	И Срав.Ключ = &Ключ
	|	И Срав.ТипИзменений В (ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Совпадение), ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Срав.ОтНачалаФайла,
	|	ВЫБОР
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление)
	|			ТОГДА 1
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка)
	|			ТОГДА 2
	|		ИНАЧЕ 10
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = Новый Структура("Текст,ТипИзменений,ИмяФункции,ТипПроблемы,Проблема,Длина,UID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Выборка);
		ДанныеОтличий.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат ДанныеОтличий;
	
КонецФункции
